package shaping

//----------------------------------------------------------------------------------------------------------------------------//

type (
	// S реализует семафор для ограничения количества одновременных операций.
	// In() захватывает токен (блокируется, если их нет).
	// Out() освобождает токен. Предполагается, что что каждому In() потом следует один и только один Out().
	S struct {
		tokens chan struct{}
	}
)

//----------------------------------------------------------------------------------------------------------------------------//

// Создаем новый шейпер, если capacity <= 0, то шейпер не будет производить ограничение
func New(capacity int) (s *S) {
	s = &S{}

	if capacity <= 0 {
		return
	}

	s.tokens = make(chan struct{}, capacity)
	for range capacity {
		s.tokens <- struct{}{}
	}

	return
}

//----------------------------------------------------------------------------------------------------------------------------//

// In получает токен, блокируясь до его доступности.
// Если S создан с capacity <= 0, возвращается немедленно.
func (s *S) In() {
	if s.tokens == nil {
		return
	}

	<-s.tokens
}

//----------------------------------------------------------------------------------------------------------------------------//

// Out освобождает токен
func (s *S) Out() {
	if s.tokens == nil {
		return
	}

	s.tokens <- struct{}{}
}

//----------------------------------------------------------------------------------------------------------------------------//
